Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, 75, 100, 50, 0                                            
__________________________________________________________________________________________________
zero0 (ZeroPadding3D)           (None, 77, 104, 54,  0           the_input[0][0]                  
__________________________________________________________________________________________________
conv0 (Conv3D)                  (None, 75, 50, 25, 3 7232        zero0[0][0]                      
__________________________________________________________________________________________________
RG0/RCAB_0_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        conv0[0][0]                      
__________________________________________________________________________________________________
activation (Activation)         (None, 75, 50, 25, 3 0           RG0/RCAB_0_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_0_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Mean (TensorFlowOpL [(None, 75, 32)]     0           RG0/RCAB_0_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape (TensorFlow [(None, 75, 1, 1, 32 0           tf_op_layer_Mean[0][0]           
__________________________________________________________________________________________________
RG0/RCAB_0/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape[0][0]        
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 75, 1, 1, 32) 0           RG0/RCAB_0/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_0/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_1[0][0]               
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_0/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_0_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid (TensorFlow [(None, 75, 1, 1, 32 0           RG0/RCAB_0/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul (TensorFlowOpLa [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_0/CA_identit
                                                                 tf_op_layer_Sigmoid[0][0]        
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_0_identity [(None, 75, 50, 25,  0           conv0[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_add (TensorFlowOpLa [(None, 75, 50, 25,  0           tf_op_layer_Mul[0][0]            
                                                                 tf_op_layer_RG0/RCAB_0_identity[0
__________________________________________________________________________________________________
RG0/RCAB_1_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add[0][0]            
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 75, 50, 25, 3 0           RG0/RCAB_1_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_1_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_2[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Mean_1 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_1_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_1 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_1[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_1/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_1[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 75, 1, 1, 32) 0           RG0/RCAB_1/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_1/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_3[0][0]               
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_1/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_1_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_1 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_1/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_1 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_1/CA_identit
                                                                 tf_op_layer_Sigmoid_1[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_1_identity [(None, 75, 50, 25,  0           tf_op_layer_add[0][0]            
__________________________________________________________________________________________________
tf_op_layer_add_1 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_1[0][0]          
                                                                 tf_op_layer_RG0/RCAB_1_identity[0
__________________________________________________________________________________________________
RG0/RCAB_2_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_1[0][0]          
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 75, 50, 25, 3 0           RG0/RCAB_2_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_2_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_4[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Mean_2 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_2_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_2 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_2[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_2/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_2[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 75, 1, 1, 32) 0           RG0/RCAB_2/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_2/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_5[0][0]               
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_2/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_2_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_2 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_2/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_2 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_2/CA_identit
                                                                 tf_op_layer_Sigmoid_2[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_2_identity [(None, 75, 50, 25,  0           tf_op_layer_add_1[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_2 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_2[0][0]          
                                                                 tf_op_layer_RG0/RCAB_2_identity[0
__________________________________________________________________________________________________
RG0/RCAB_3_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_2[0][0]          
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 75, 50, 25, 3 0           RG0/RCAB_3_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_3_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_6[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Mean_3 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_3_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_3 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_3[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_3/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_3[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 75, 1, 1, 32) 0           RG0/RCAB_3/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_3/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_7[0][0]               
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_3/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_3_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_3 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_3/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_3 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_3/CA_identit
                                                                 tf_op_layer_Sigmoid_3[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_3_identity [(None, 75, 50, 25,  0           tf_op_layer_add_2[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_3 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_3[0][0]          
                                                                 tf_op_layer_RG0/RCAB_3_identity[0
__________________________________________________________________________________________________
RG0/RCAB_4_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_3[0][0]          
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 75, 50, 25, 3 0           RG0/RCAB_4_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_4_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_8[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Mean_4 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_4_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_4 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_4[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_4/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_4[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 75, 1, 1, 32) 0           RG0/RCAB_4/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_4/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_9[0][0]               
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_4/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_4_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_4 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_4/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_4 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_4/CA_identit
                                                                 tf_op_layer_Sigmoid_4[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_4_identity [(None, 75, 50, 25,  0           tf_op_layer_add_3[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_4 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_4[0][0]          
                                                                 tf_op_layer_RG0/RCAB_4_identity[0
__________________________________________________________________________________________________
RG0/RCAB_5_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_4[0][0]          
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 75, 50, 25, 3 0           RG0/RCAB_5_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_5_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_10[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Mean_5 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_5_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_5 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_5[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_5/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_5[0][0]      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 75, 1, 1, 32) 0           RG0/RCAB_5/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_5/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_11[0][0]              
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_5/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_5_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_5 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_5/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_5 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_5/CA_identit
                                                                 tf_op_layer_Sigmoid_5[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_5_identity [(None, 75, 50, 25,  0           tf_op_layer_add_4[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_5 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_5[0][0]          
                                                                 tf_op_layer_RG0/RCAB_5_identity[0
__________________________________________________________________________________________________
RG0/RCAB_6_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_5[0][0]          
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 75, 50, 25, 3 0           RG0/RCAB_6_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_6_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_12[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Mean_6 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_6_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_6 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_6[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_6/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_6[0][0]      
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 75, 1, 1, 32) 0           RG0/RCAB_6/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_6/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_13[0][0]              
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_6/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_6_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_6 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_6/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_6 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_6/CA_identit
                                                                 tf_op_layer_Sigmoid_6[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_6_identity [(None, 75, 50, 25,  0           tf_op_layer_add_5[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_6 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_6[0][0]          
                                                                 tf_op_layer_RG0/RCAB_6_identity[0
__________________________________________________________________________________________________
RG0/RCAB_7_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_6[0][0]          
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 75, 50, 25, 3 0           RG0/RCAB_7_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_7_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_14[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Mean_7 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_7_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_7 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_7[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_7/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_7[0][0]      
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 75, 1, 1, 32) 0           RG0/RCAB_7/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_7/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_15[0][0]              
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_7/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_7_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_7 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_7/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_7 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_7/CA_identit
                                                                 tf_op_layer_Sigmoid_7[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_7_identity [(None, 75, 50, 25,  0           tf_op_layer_add_6[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_7 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_7[0][0]          
                                                                 tf_op_layer_RG0/RCAB_7_identity[0
__________________________________________________________________________________________________
RG0/RCAB_8_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_7[0][0]          
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 75, 50, 25, 3 0           RG0/RCAB_8_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_8_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_16[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Mean_8 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_8_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_8 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_8[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_8/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_8[0][0]      
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 75, 1, 1, 32) 0           RG0/RCAB_8/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_8/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_17[0][0]              
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_8/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_8_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_8 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_8/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_8 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_8/CA_identit
                                                                 tf_op_layer_Sigmoid_8[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_8_identity [(None, 75, 50, 25,  0           tf_op_layer_add_7[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_8 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_8[0][0]          
                                                                 tf_op_layer_RG0/RCAB_8_identity[0
__________________________________________________________________________________________________
RG0/RCAB_9_conv3d-1 (Conv3D)    (None, 75, 50, 25, 3 9248        tf_op_layer_add_8[0][0]          
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 75, 50, 25, 3 0           RG0/RCAB_9_conv3d-1[0][0]        
__________________________________________________________________________________________________
RG0/RCAB_9_conv3d-2 (Conv3D)    (None, 75, 50, 25, 3 9248        activation_18[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Mean_9 (TensorFlowO [(None, 75, 32)]     0           RG0/RCAB_9_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_9 (TensorFl [(None, 75, 1, 1, 32 0           tf_op_layer_Mean_9[0][0]         
__________________________________________________________________________________________________
RG0/RCAB_9/CA_conv3d-1 (Conv3D) (None, 75, 1, 1, 32) 1056        tf_op_layer_Reshape_9[0][0]      
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 75, 1, 1, 32) 0           RG0/RCAB_9/CA_conv3d-1[0][0]     
__________________________________________________________________________________________________
RG0/RCAB_9/CA_conv3d-2 (Conv3D) (None, 75, 1, 1, 32) 1056        activation_19[0][0]              
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_9/CA_ident [(None, 75, 50, 25,  0           RG0/RCAB_9_conv3d-2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Sigmoid_9 (TensorFl [(None, 75, 1, 1, 32 0           RG0/RCAB_9/CA_conv3d-2[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Mul_9 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_RG0/RCAB_9/CA_identit
                                                                 tf_op_layer_Sigmoid_9[0][0]      
__________________________________________________________________________________________________
tf_op_layer_RG0/RCAB_9_identity [(None, 75, 50, 25,  0           tf_op_layer_add_8[0][0]          
__________________________________________________________________________________________________
tf_op_layer_add_9 (TensorFlowOp [(None, 75, 50, 25,  0           tf_op_layer_Mul_9[0][0]          
                                                                 tf_op_layer_RG0/RCAB_9_identity[0
__________________________________________________________________________________________________
RG0_rg-conv-1 (Conv3D)          (None, 75, 50, 25, 3 9248        tf_op_layer_add_9[0][0]          
__________________________________________________________________________________________________
tf_op_layer_RG0_identity (Tenso [(None, 75, 50, 25,  0           conv0[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_add_10 (TensorFlowO [(None, 75, 50, 25,  0           RG0_rg-conv-1[0][0]              
                                                                 tf_op_layer_RG0_identity[0][0]   
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 75, 50, 25, 3 9248        tf_op_layer_add_10[0][0]         
__________________________________________________________________________________________________
batc1 (BatchNormalization)      (None, 75, 50, 25, 3 128         conv1[0][0]                      
__________________________________________________________________________________________________
actv1 (Activation)              (None, 75, 50, 25, 3 0           batc1[0][0]                      
__________________________________________________________________________________________________
spatial_dropout3d (SpatialDropo (None, 75, 50, 25, 3 0           actv1[0][0]                      
__________________________________________________________________________________________________
max1 (MaxPooling3D)             (None, 75, 25, 12, 3 0           spatial_dropout3d[0][0]          
__________________________________________________________________________________________________
zero2 (ZeroPadding3D)           (None, 77, 29, 16, 3 0           max1[0][0]                       
__________________________________________________________________________________________________
conv2 (Conv3D)                  (None, 75, 25, 12, 6 153664      zero2[0][0]                      
__________________________________________________________________________________________________
batc2 (BatchNormalization)      (None, 75, 25, 12, 6 256         conv2[0][0]                      
__________________________________________________________________________________________________
actv2 (Activation)              (None, 75, 25, 12, 6 0           batc2[0][0]                      
__________________________________________________________________________________________________
spatial_dropout3d_1 (SpatialDro (None, 75, 25, 12, 6 0           actv2[0][0]                      
__________________________________________________________________________________________________
max2 (MaxPooling3D)             (None, 75, 12, 6, 64 0           spatial_dropout3d_1[0][0]        
__________________________________________________________________________________________________
zero3 (ZeroPadding3D)           (None, 77, 14, 8, 64 0           max2[0][0]                       
__________________________________________________________________________________________________
conv3 (Conv3D)                  (None, 75, 12, 6, 96 165984      zero3[0][0]                      
__________________________________________________________________________________________________
batc3 (BatchNormalization)      (None, 75, 12, 6, 96 384         conv3[0][0]                      
__________________________________________________________________________________________________
actv3 (Activation)              (None, 75, 12, 6, 96 0           batc3[0][0]                      
__________________________________________________________________________________________________
spatial_dropout3d_2 (SpatialDro (None, 75, 12, 6, 96 0           actv3[0][0]                      
__________________________________________________________________________________________________
max3 (MaxPooling3D)             (None, 75, 6, 3, 96) 0           spatial_dropout3d_2[0][0]        
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 75, 1728)     0           max3[0][0]                       
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 75, 512)      3048960     time_distributed[0][0]           
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 75, 512)      1181184     bidirectional[0][0]              
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 75, 28)       14364       bidirectional_1[0][0]            
__________________________________________________________________________________________________
softmax (Activation)            (None, 75, 28)       0           dense1[0][0]                     
==================================================================================================
Total params: 4,796,732
Trainable params: 4,796,348
Non-trainable params: 384
__________________________________________________________________________________________________
